Tekla Open API Reference for Tekla Structures 2025
PointList.IndexOf Method (Point, Int32, Int32)
 Gets the index of the specified point between the index to start the search from and startIndex + count.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public int IndexOf(
	Point value,
	int startIndex,
	int count
)
Public Function IndexOf (
	value As Point,
	startIndex As Integer,
	count As Integer
) As Integer
Parameters
value
Type: Tekla.Structures.Geometry3d.Point
The point to locate in the list.
startIndex
Type: System.Int32
The index to start the search from.
count
Type: System.Int32
The number of items searched.
Return Value
Type: Int32
The index of the point if found in the list, otherwise -1.
See Also
Reference
PointList Class
IndexOf Overload
Tekla.Structures.Drawing Namespace